; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 824524 1 2 2 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Star8 spectrograph0)
	(have_image Star9 image1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation0 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
5. (take_image satellite0 star9 instrument1 image1)
   added: (have_image star9 image1)
   goals met: 1 of 7
6. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 1 of 7
7. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 2 of 7
8. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 3 of 7
9. (turn_to satellite0 planet12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet12)
   goals met: 2 of 7
10. (take_image satellite0 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 3 of 7
11. (turn_to satellite0 star7 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star7)
   goals met: 4 of 7
12. (turn_to satellite0 phenomenon11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon11 instrument1 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 4 of 7
14. (turn_to satellite0 star7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star7)
   goals met: 5 of 7
15. (turn_to satellite0 phenomenon10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 7
16. (take_image satellite0 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 5 of 7
17. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   goals met: 6 of 7
18. (turn_to satellite0 phenomenon13 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 7
19. (take_image satellite0 phenomenon13 instrument1 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 6 of 7
20. (turn_to satellite0 star7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star7)
   goals met: 7 of 7
